{
  "dailyMessages": [
    "{name}, Week 2 is where many start to feel hunger and lose focus. Remember, sticking to your {goal} plan today sets the stage for a stronger tomorrow. Weekend temptations happen, but you’ve got the power to choose progress.",
    "It’s normal to feel the struggle in Week 2, {name}. Protein is your best friend now—it fuels muscle, curbs hunger, and keeps your metabolism burning. Stay committed to your {goal}, and don’t let one weekend slip define your journey.",
    "You’re building a new routine, {name}, and that takes time. Even when life gets busy, trust your master plan and honor your {goal}. Small consistent wins every day create lasting change.",
    "Week 2 means more than just food; it’s about your mindset. When cravings hit or the weekend feels rough, remind yourself why you started this journey toward your {goal}, {name}. Progress is earned one choice at a time.",
    "Protein repairs and rebuilds muscle, {name}—your secret weapon in this phase. Even if weekends were a little loose, get back on track with your {goal} plan today. Consistency over perfection wins the race.",
    "{name}, the weekend may have tested your resolve, but it didn’t break it. Stay focused on fueling your body with hearty, nutrient-dense foods that support your {goal}. You’re stronger than any excuse.",
    "Life is busy, {name}, and skipping meals can become a habit if you aren’t careful. Stick with your {goal} plan by planning meals ahead and prioritizing protein-rich foods. You’re in control—own it.",
    "Remember, {name}, it’s okay to feel challenged this week. The important thing is you don’t give up. Each day you commit to your {goal} is a victory on your path to transformation.",
    "{name}, your journey isn’t about perfection—it’s about progress. Embrace the process, even when hunger or stress tries to pull you off course. Your {goal} is worth every effort.",
    "You’re learning what works for you, {name}, and that’s powerful. Protein keeps you full and focused—lean on it as you navigate Week 2. Your {goal} is closer than you think.",
    "Stay patient, {name}. Muscle takes time to build, and so does a new habit. Your {goal} journey is a marathon, not a sprint.",
    "Cravings are tough, but your will is tougher, {name}. When hunger hits, choose foods that nourish and fuel your {goal} progress.",
    "Remember why you started, {name}. Every meal and workout is a step closer to your {goal}. Stay disciplined and enjoy the ride.",
    "Week 2 is about consistency and commitment, {name}. Even if your weekend wasn’t perfect, today’s a fresh chance to honor your {goal}.",
    "You’ve got this, {name}. Your body is adapting, and your discipline is growing. Keep fueling that {goal} with good nutrition and smart choices.",
    "Busy days test your plan, {name}. Prep ahead and prioritize protein to keep hunger at bay and energy high for your {goal}.",
    "Each choice matters, {name}. When temptation knocks, remind yourself your {goal} is worth more than a momentary craving.",
    "The power to change your habits is in your hands, {name}. Commit fully to your {goal} and watch your progress multiply.",
    "Healthy habits compound, {name}. What you do today for your {goal} will pay dividends tomorrow.",
    "Fuel your strength with smart choices, {name}. Protein-rich meals keep you full and ready to crush your {goal}."
  ],
  "motivationalMessages": [
    "Glen says: Real progress comes from consistency, not perfection. Keep showing up.",
    "Remember, {name}, the toughest battles lead to the greatest victories.",
    "Glen says: Hunger is temporary. Success is forever.",
    "Push through the tough days, {name}, they build unshakable discipline.",
    "Glen says: Your mindset is the foundation of your {goal}. Train it daily.",
    "Stay patient and trust the process. Your body is adapting, {name}.",
    "Every protein-packed meal fuels your strength and resilience.",
    "Let setbacks be lessons, not excuses. You’re still moving forward.",
    "Focus on what you can control today, {name}. The rest will follow.",
    "Celebrate progress, no matter how small. Each step counts."
  ]
}
