{
  "week1": {
    "messages": [
      "Preparation is your secret weapon, {name}. Sticking to your plan is the key to unlocking success, no matter your goal. Remember, consistency beats perfection every time.",
      "Your focus today builds tomorrow’s results. Keep your eyes on your {goal} goal and remember why you started. Every meal and choice is a step toward victory.",
      "{name}, this journey is about more than food—it’s about forging discipline and character. Lean into the process and watch how your {goal} progress unfolds.",
      "Start strong, {name}. Nourishing your body with intention sets the tone for the entire day. Your {goal} goal is within reach when you honor your plan.",
      "Don’t let distractions knock you off course. Your {goal} journey requires a master plan and the will to stick with it. You’re building habits that will last a lifetime.",
      "Consistency in nutrition fuels your progress. {name}, keep pushing toward your {goal} with purpose and focus. You’re stronger than any excuse.",
      "Meal prep isn’t just about food—it’s about reclaiming control over your day. {name}, your commitment to your {goal} is your superpower.",
      "Every choice you make feeds your future. Stay locked into your {goal} plan and let nothing deter your momentum, {name}.",
      "Your discipline today creates your transformation tomorrow. Remember, {name}, the path to your {goal} is paved with daily decisions.",
      "Small wins add up. Celebrate every meal prepped, every healthy choice, and every step closer to your {goal}, {name}.",
      "Fuel your body like the champion you are, {name}. Your {goal} demands your best effort, and you’re more than capable of delivering it.",
      "Sticking to the plan isn’t always easy, but it’s always worth it. Keep your {goal} in sight, {name}, and stay relentless in pursuit.",
      "The road to your {goal} isn’t a sprint—it’s a marathon. {name}, pace yourself, stay consistent, and trust the process.",
      "Your meals are the building blocks of your transformation. {name}, honor your {goal} by nourishing with intention and care.",
      "Refuel with purpose, {name}. Your {goal} depends on how well you recover and prepare for what’s next.",
      "Accountability starts with you. Own your {goal} journey, {name}, and remember that every decision counts.",
      "Your {goal} is personal, and so is your power. {name}, keep showing up and the results will follow.",
      "Don’t let one off day define you. {name}, recommit to your {goal} plan and keep moving forward.",
      "When temptation calls, remember your why. Your {goal} is worth every sacrifice, {name}.",
      "Master your routine, master your {goal}. {name}, success is built on consistent habits.",
      "Plan your meals, plan your success. {name}, your {goal} is a reflection of your preparation.",
      "You’ve got the tools and the talent, {name}. Now it’s time to execute your {goal} plan with grit and grace.",
      "Keep your eyes on the prize, {name}. Your {goal} is a journey worth every effort you put in.",
      "The discipline you build now will carry you beyond your {goal}, {name}. This is more than a program—it’s a lifestyle.",
      "Celebrate the small victories, {name}. Every healthy meal and workout brings you closer to your {goal}.",
      "Consistency is your best friend on this journey, {name}. Stay committed to your {goal} plan and success will follow.",
      "Remember, {name}, nutrition fuels not just your body but your confidence too. Own your {goal} journey with pride.",
      "Make each meal count, {name}. Your {goal} demands your focus and dedication, and you’re ready to deliver.",
      "Your plan is your roadmap, {name}. Trust it, follow it, and watch your {goal} come to life.",
      "No shortcuts, just steady progress. {name}, your {goal} is a marathon, and you’re in it for the long haul.",
      "Harness your discipline, {name}. Your {goal} is within reach when you honor your plan every day.",
      "You’re writing your own success story, {name}. Keep the {goal} vision clear and the habits strong.",
      "Fuel your ambition with intentional meals, {name}. Your {goal} depends on the consistency you show today.",
      "Trust the process, {name}. Your {goal} will reward your persistence and focus.",
      "It’s okay to have tough days, {name}. What matters is that you come back stronger toward your {goal}.",
      "Stay hungry for success, not just food, {name}. Your {goal} is waiting on the other side of discipline.",
      "Your daily choices build your legacy, {name}. Keep your {goal} front and center in every decision.",
      "Stay relentless, {name}. Your {goal} isn’t just about weight—it’s about building unshakable confidence.",
      "Preparation today makes tomorrow easier, {name}. Stay committed to your {goal} and trust the journey.",
      "Your {goal} journey is uniquely yours, {name}. Own it with pride and purpose every single day.",
      "The power to change is in your hands, {name}. Stay focused and dedicated to your {goal} plan.",
      "Keep moving forward, {name}. Your {goal} is achievable through consistent, intentional effort.",
      "You are stronger than any excuse, {name}. Your {goal} is worth the work and the discipline.",
      "Every step toward your {goal} counts, {name}. Keep your head high and your plan tight.",
      "Your commitment is your greatest asset, {name}. Stay true to your {goal} and let the results follow."
    ],
    "quotes": [
  "‘You must do what you have never done to get what you have never gotten.’",
  "‘Having a plan means one less thing to think about when life gets busy.’",
  "‘Discipline is not just a task; it’s the foundation of your new identity.’",
  "‘The plan is your anchor when the waves of temptation come crashing.’",
  "‘Commitment to the process beats motivation every single time.’",
  "‘Glen says: Consistency is the true game changer in any transformation.’",
  "‘Glen says: Trust the process even when the results aren’t immediate.’",
  "‘Glen says: Every small victory adds up to a huge success story.’",
  "‘Success doesn’t come from luck—it comes from showing up day after day.’",
  "‘Your mindset shapes your journey; stay relentless and focused.’"
]
  }
}
